# NominalWeight Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionAnalysisParams..::..NominalWeight Property
StructuralSectionAnalysisParams Class See Also
---
Unit weight (not mass) per unit length, for self-weight calculation or quantity survey.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public double NominalWeight { get; set; }
```

Visual Basic
---
```text
Public Property NominalWeight As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double NominalWeight {
	double get ();
	void set (double value);
}
```

# See Also
StructuralSectionAnalysisParams Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace